[Killed] Logical mutation
EstoqueService.cs:20:17
                 prazo += 2;
             }
 
-            if (sku.Contains("-TM") || sku.Contains("-TG"))
+            if (sku.Contains("-TM") && sku.Contains("-TG"))
             {
                 prazo += 2;

[Killed] Negate expression
EstoqueService.cs:20:17
                 prazo += 2;
             }
 
-            if (sku.Contains("-TM") || sku.Contains("-TG"))
+            if (!(sku.Contains("-TM") || sku.Contains("-TG")))
             {
                 prazo += 2;

[Killed] Negate expression
EstoqueService.cs:24:21
             {
                 prazo += 2;
 
-                if (qtd > 5)
+                if (!(qtd > 5))
                 {
                     throw new Exception("Qtd invalida para tamanhos medio e grande");

[Killed] Equality mutation
EstoqueService.cs:24:21
             {
                 prazo += 2;
 
-                if (qtd > 5)
+                if (qtd < 5)
                 {
                     throw new Exception("Qtd invalida para tamanhos medio e grande");

[Survived] Equality mutation
EstoqueService.cs:28:26
                 {
                     throw new Exception("Qtd invalida para tamanhos medio e grande");
                 } 
-                else if (qtd > 1)
+                else if (qtd >= 1)
                 {
                     prazo = qtd * 2;

[Survived] Negate expression
EstoqueService.cs:28:26
                 {
                     throw new Exception("Qtd invalida para tamanhos medio e grande");
                 } 
-                else if (qtd > 1)
+                else if (!(qtd > 1))
                 {
                     prazo = qtd * 2;

[Killed] Arithmetic mutation
EstoqueService.cs:30:29
                 } 
                 else if (qtd > 1)
                 {
-                    prazo = qtd * 2;
+                    prazo = qtd / 2;
                 }
             }
