[Killed] Negate expression
EstoqueService.cs:11:17
         {
             int prazo = 1;
 
-            if (sku.StartsWith("CB") || sku.StartsWith("PF") || sku.StartsWith("EX"))
+            if (!(sku.StartsWith("CB") || sku.StartsWith("PF") || sku.StartsWith("EX")))
             {
                 prazo += 1;

[Killed] Logical mutation
EstoqueService.cs:11:17
         {
             int prazo = 1;
 
-            if (sku.StartsWith("CB") || sku.StartsWith("PF") || sku.StartsWith("EX"))
+            if (sku.StartsWith("CB") || sku.StartsWith("PF") && sku.StartsWith("EX"))
             {
                 prazo += 1;

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
EstoqueService.cs:13:17
 
             if (sku.StartsWith("CB") || sku.StartsWith("PF") || sku.StartsWith("EX"))
             {
-                prazo += 1;
+                                prazo -=1;
             }
             else

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
EstoqueService.cs:17:17
             }
             else
             {
-                prazo += 2;
+                                prazo -=2;
             }
 
