[Killed] Negate expression
CarrinhoService.cs:9:17
     {
         public decimal FecharCarrinho(string sku, decimal valorUnitario, int qtd)
         {
-            if (qtd > 99)
+            if (!(qtd > 99))
             {
                 throw new Exception();

[Killed] Equality mutation
CarrinhoService.cs:9:17
     {
         public decimal FecharCarrinho(string sku, decimal valorUnitario, int qtd)
         {
-            if (qtd > 99)
+            if (qtd < 99)
             {
                 throw new Exception();

[Killed] Arithmetic mutation
CarrinhoService.cs:14:20
                 throw new Exception();
             }
             
-            return qtd * valorUnitario;
+            return qtd / valorUnitario;
         }
     }
